package 소통해요;

public class 라이브러리적용하고설명적기 {
	/*적용하고 이름과 날짜 적어주세요
	 * 
	 * 양식
	 * [라이브러리] : [설명]
	 * [이름] [날짜] [코멘트]
	 * ---------------------------------------------------------------------
	 * 
	 * Lombok : 게터, 세터 자동 생성 관리 라이브러리
	 * SpringBoot DevTools : 코드 업데이트되면, 재시작 안 해도 크롬에 적용해주는 라이브러리
	 * MyBatis Framework : 이름 같으면 매퍼, 데이터베이스 자동 연동하게 해주는 라이브러리
	 * MySQL Driver : 우리가 쓸 데이터베이스
	 * 우빈 250718 15:00 선생님이랑 같이 했던 것 중에 일부만 적용함.
	 * 
	 * ---------------------------------------------------------------------
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * */
}
